<?php
//Задание №2
$i = 0;
function pow1($i)
{
    if ($i == 0)
    echo "$i" . ' - это ноль<br />' ;
    elseif ($i % 2 != 0)
    echo "$i" . ' - нечетное число<br />';
    elseif ($i % 2 == 0)
    echo "$i" . ' - четное число<br />';
}

do 
{
    pow1 ($i);
    $i++;
} while ($i <= 10);

// Задание №3 переделала по задание №8
$arrayObl = [
    " Московская область:" => array (
        "Москва", 
        "Зеленоград",
        "Клин"),
    " Ленинградская область:" => [
        "Санкт-Петербург", 
        "Всеволожск", 
        "Павловск", 
        "Кронштадт"],
    "Рязанская область:" => [
        "Рязань", 
        "Спасск-Рязанский", 
        "Шилово"],
    ];
echo $arrayObl[" Московская область"][2];          //выводим для теста второй ключ Моск облости - это будет "Клин"
 
echo "<br>";
 
foreach ($arrayObl as $obl => $city) {      //Перебор массива для вывода каждой обл и города
    echo $obl . " <br>";                   //эхнули каждую область
    foreach ($city as $cityName) {   
        if ($cityName[0].$cityName[1]== "К") {      //цикл в цикле для вывода городов в областях.
        echo  "-" .  $cityName . "<br>"; //вывод городов
        };
    };
};

// Задание №4
 function rus2translit($string) {
    $converter = array(
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
        
        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
    );
    return strtr($string, $converter);
};

echo rus2translit("У попа была собака <br>");


//Задание №5
function spaceReplace($str) {
    return str_replace(" ", "_", $str);
}

?>